app/controllers/questionnaires_controller.rb

  def top
    @requests = Request.all
---
SELECT "requests".* FROM "requests"