app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_name" = ?, "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", ""], ["first_name", ""], ["updated_at", "2020-10-13 13:08:04.291398"], ["id", 1]]